test("Questão 5", () =>{
		expect(verificarVencedor([1, 2, 3, 4, 5, 6], [[1, 2, 3, 4, 5, 6], [11, 22, 33, 44, 55, 60], [11, 12, 13, 14, 15, 16]])).toBe("sena");
		expect(verificarVencedor([1, 2, 3, 4, 5, 6], [[11, 12, 13, 14, 15, 16], [11, 22, 33, 44, 55, 60], [1, 2, 3, 4, 5, 16]])).toBe("quina");
		expect(verificarVencedor([1, 2, 3, 4, 5, 6], [[1, 2, 3, 4, 5, 16], [11, 22, 33, 44, 55, 60], [1, 2, 3, 4, 5, 6]])).toBe("sena");
		expect(verificarVencedor([1, 2, 3, 4, 5, 6], [[21, 22, 23, 24, 25, 26], [11, 22, 33, 44, 55, 60], [11, 12, 13, 14, 15, 16]])).toBe("nenhum");
		expect(verificarVencedor([1, 2, 3, 4, 5, 6], [[1, 2, 3, 4, 5], [11, 12, 13, 14, 15, 16]])).toBe("nenhum");
		expect(verificarVencedor([1, 2, 3, 4, 5, 6], [[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16], [11, 12, 13, 14, 15, 16]])).toBe("nenhum");
	}
)